trade_exp/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Сотрудники</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b57ce5b7-9e28-4f84-a668-467a507068c3">
    <name>Должность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="613a9982-ea2e-40bd-b0e1-5642e976be87">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c97fb60c-ec2d-420a-93a9-39602a2bbfdf">
    <name>Уволен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18560314-7951-472c-8aac-2a5b52d0acfe">
    <name>Отдел</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf0376ac-0d78-4ccb-88b0-6fb290797677">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aa27d4c3-5c6c-4d49-bc20-f0d9faedd48f">
    <name>РольОПШ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f20e46f-464f-4f7c-85f2-c2ceb761c7ca">
    <name>ДатаУвольнения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea584be0-70fa-40c6-9056-0ac6d48f5544">
    <name>ДатаПриема</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="93190e85-82b5-4f8d-86d4-60a3ed158497">
    <name>ИзменятьТребуетПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ae0a6a00-9b29-4553-88a2-43a85bee5a3a">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2c716114-b753-459f-820d-3eefc10412b6">
    <name>ИдентификаторМобильногоПриложения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0e3a882-dc26-453d-ae18-394afecbe606">
    <name>ЦельПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e140be66-a953-4235-9404-eb1e4326c329">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e204e166-c00a-4107-b2f6-e178a0260ea2">
    <name>ПотребностьВСлужебномТранспорте</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e321359-c912-4451-9965-e660dd87561c">
    <name>ВГрафике</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="75ed98aa-60db-49f8-9e60-419549eea6b0">
    <name>Касса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="81ba44aa-675f-4a78-bd9e-bd949a5d139f">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c56826a-54b5-44f6-b674-4f57e9006ae4">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c365c143-4ee2-4da0-840a-f5707c956f21">
    <name>ИзменятьЦель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1bad7ab2-c198-4c43-a6cd-a4c4dcb497cf">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="824f90f8-db60-4eee-ae25-c8da8bd31141">
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="46ca7a78-d4ae-44ee-8d05-a15add9f79c4">
    <name>ПутьДляФотоСТСД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7b035ccb-950d-48ec-ba42-fbcf94fe0d51">
    <name>УстанавливатьПериодНеПозднее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7162254b-c2fe-4139-94ea-cc0f720a9b3d">
    <name>ИзменятьТипПропуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="961c74cb-fce1-43c3-af7f-b67d404817cb">
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6667f724-4527-4af9-9d26-f2ced65f4ed5">
    <name>ВыгружатьНаСайт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e43fec11-e2d6-4ba1-935e-cfc4047484d6">
    <name>Индивидуально</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="35688e1d-3d5d-4ba4-a2d2-a8ae02028ceb">
    <name>УровеньДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9dfb1156-61b0-4cf6-a749-49cf491b66af">
    <name>ЗапретитьСоздаватьПропуск</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="662ef78d-bb7a-4142-8543-46c55d375e3a">
    <name>ИзменятьПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0983b722-4b9b-4508-9502-eadb41d5ef36">
    <name>ТабельныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="25fb4b64-3389-40d8-a0fb-1a48696c5f69">
    <name>ДатаПеревода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="de354010-7d67-44cf-87d4-e48af516a477">
    <name>РольМобильногоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6020fb7b-5fb1-4cf3-a1df-ee412178682d">
    <name>ДолжностьЗУП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="44079ee7-c820-4e7e-90b6-b558be1c261a">
    <name>ПодразделениеЗУП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ae05a309-265f-484f-b720-0b93517910b0">
    <name>ОповещенияИзОчереди</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6d6189b4-cd43-4428-b345-8c04fb2cba4c">
    <name>ВышестоящееПодразделениеЗУП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="df0fd9e1-cd5c-4ecd-9102-493f1dbba937">
    <name>ВнутреннийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41e900a7-c10f-4f56-bc62-69d7108bc92e">
    <name>КорпоративныйТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1973c897-b5f8-4020-b1e7-47881040abeb">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0fdb6ac0-b230-43d6-b6e7-bd153e64f5a0">
    <name>Удаленщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7fb666be-2e07-4d2e-8843-dcec84180a27">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d44aa133-8703-4fc0-b5ff-67b13c6f1ea4">
    <name>ДопУтверждениеББ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="57989287-32be-4a51-8f5a-0c9a27b45041">
    <name>ПравоНаПроверку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0150eb34-5757-4b0a-b42e-18cb40c1f263">
    <name>ПравоНаСогласование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba7e389d-4b02-43cb-9a13-1b3a0f9a4be1">
    <name>Аутсорс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="de79966c-ad14-441f-95c9-e94a04bef8bc">
    <name>СписокЗон</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a6561ebb-def2-4423-834a-41631f1b243a">
      <name>ЗонаДоступа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="aff5c93c-abdd-44ce-86ba-3df5ea78303d">
    <name>РабочиеУчастки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e6045355-ff14-41a0-a6e6-dba35c5249a7">
      <name>РабочийУчасток</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e6b14f6a-ed6b-424d-92dd-c34e7f8b22e6">
    <name>БейджыВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d1e828b1-f591-4c25-9e7e-aeef3e67afb2">
      <name>ТранспортноеСредство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="806f21ff-78a2-4496-90c9-dfd5253a5be0">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>15</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="69aeacfc-4a6b-4d95-9201-ae704bbb53c0">
      <name>Наименование</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>60</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Пользователи</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="d7cfc87f-ac09-44aa-91d9-6511c408c5cb">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cc8e3172-491d-45d8-a7eb-fc6c400845cb">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ae6d0e12-8857-476c-b4b2-f03295cbed3e">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="d6969c1e-e13c-4542-abb7-9cf6bb50b8e2">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="bbbfb817-8db3-4415-86c3-af028276d6e9">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aa7d5ca4-3c02-4ca1-a790-2435ee9f9f02">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/ГруппыДоступа/ГруппыДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d0106f3a-8490-4277-a278-75c318ec252c">
  <name>ГруппыДоступа</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="0132e564-2cd3-4930-8962-1068532f4be4">
    <name>Пользователи</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="57d0f9b0-18d0-48ba-9f3c-d106f66ac602">
      <name>Пользователь</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/HTTPServices/ОбменАкадемия/Module.bsl
Функция ПолучитьСотрудниковПолучитьСоттрудников(Запрос)
	УстановитьПривилегированныйРежим(Истина);
	
	Ответ = Новый HTTPСервисОтвет(200);
	//Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", "*");
	Ответ.Заголовки.Вставить("Content-Type", "text/html");
	Ответ.Заголовки.Вставить("Access-Control-Allow-Methods", "OPTIONS, GET"); 
	
	ДанныеJSON= ПолучитьJSON();
	стрJSON= АльтерраОбщегоНазначения.СформироватьСтрокуJSON(ДанныеJSON);
	Ответ.УстановитьТелоИзСтроки(стрJSON);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;
КонецФункции

 Функция ПолучитьJSON() 
	 ЗаписьЖурналаРегистрации("РегламентноеЗадание.ВыгрузкаСотрудниковJSON", УровеньЖурналаРегистрации.Примечание, , , "Начало формирования прайса");

	 ПакетЗапросов= ПолучитьДанныеВыгрузки();
	 
	 //ВЫГРУЗКА
	 ДанныеJSON= Новый Соответствие;
	 
	 //Должности
	 Выборка= ПакетЗапросов[1].Выбрать();
	 мДолжности= Новый Массив;
	 Пока Выборка.Следующий() Цикл
		 Данные= Новый Структура;
		 Данные.Вставить("Код", XMLСтрока(Выборка.Код));
		 Данные.Вставить("Наименование", XMLСтрока(Выборка.Наименование));
		 
		 мДолжности.Добавить(Данные);
	 КонецЦикла;
	 
	 //Отделы
	 Выборка= ПакетЗапросов[2].Выбрать();
	 мОтделы= Новый Массив;
	 Пока Выборка.Следующий() Цикл
		 Данные= Новый Структура;
		 Данные.Вставить("Код", XMLСтрока(Выборка.Код));
		 Данные.Вставить("Наименование", XMLСтрока(Выборка.Наименование));
		 
		 мОтделы.Добавить(Данные);
	 КонецЦикла;
	 
	 //Подразделения
	 Выборка= ПакетЗапросов[3].Выбрать();
	 мПодразделений= Новый Массив;
	 Пока Выборка.Следующий() Цикл
		 Данные= Новый Структура;
		 Данные.Вставить("Код", XMLСтрока(Выборка.Код));
		 Данные.Вставить("Наименование", XMLСтрока(Выборка.Наименование));
		 
		 мПодразделений.Добавить(Данные);
	 КонецЦикла;
	 
	 //Сотрудники
	 Выборка= ПакетЗапросов[0].Выбрать();
	 мСотрудников= Новый Массив;
	 Пока Выборка.Следующий() Цикл
		 Данные= Новый Структура;
		 Данные.Вставить("Код", XMLСтрока(Выборка.Код));
		 Данные.Вставить("ФИО", XMLСтрока(Выборка.Наименование));
		 Данные.Вставить("Должность", XMLСтрока(Выборка.ДолжностьКод));
		 Данные.Вставить("Отдел", XMLСтрока(Выборка.ОтделКод));
		 Данные.Вставить("Подразделение", XMLСтрока(Выборка.ПодразделениеКод));
		 Данные.Вставить("Телефон", XMLСтрока(Выборка.Телефон));
		 Данные.Вставить("Пароль", XMLСтрока(Выборка.Пароль));
		 Данные.Вставить("Рководитель", XMLСтрока(Выборка.ОтделРуководительКод));
		 Данные.Вставить("Уволен", XMLСтрока(Выборка.Уволен));
		 Данные.Вставить("ДатаОкончанияДоступа", XMLСтрока(Формат(Выборка.ДатаУвольнения, "ДФ=dd.MM.yyyy")));
		 Если ЗначениеЗаполнено(Выборка.Партнер) Тогда
			 Данные.Вставить("Роль", XMLСтрока(0));
		 Иначе
			 Данные.Вставить("Роль", XMLСтрока(1));
		 КонецЕсли;
		 
		 мСотрудников.Добавить(Данные);
	 КонецЦикла;
	 
	 ДанныеJSON.Вставить("Должности", мДолжности);
	 ДанныеJSON.Вставить("Отделы", мОтделы);
	 ДанныеJSON.Вставить("Подразделения", мПодразделений);
	 ДанныеJSON.Вставить("Сотрудники", мСотрудников);
	 
	 //////// Записать в JSON /////////////////
	 Папка= "C:\Bitrix\Прайсы";
	 //КаталогНаСайте= "/include/JSON/";
	 КаталогНаСайте= "~";
	 ИмяФайла= "workers.json";
	 
	 ИмяВременногоФайла= Папка+"\"+ИмяФайла;
	 
	 JSON= Новый ЗаписьJSON;
	 ПараметрыЗаписи= Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Windows, Символы.Таб);
	 JSON.ОткрытьФайл(ИмяВременногоФайла, "UTF-8 ", , ПараметрыЗаписи);
	 ЗаписатьJSON(JSON, ДанныеJSON); 	
	 JSON.Закрыть();
	 
	 Возврат ДанныеJSON;
 КонецФункции

 Функция ПолучитьДанныеВыгрузки()
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	Сотрудники.Ссылка КАК Ссылка,
	 |	Сотрудники.Код КАК Код,
	 |	Сотрудники.Наименование КАК Наименование,
	 |	Сотрудники.Должность.Код КАК ДолжностьКод,
	 |	Сотрудники.Отдел.Код КАК ОтделКод,
	 |	Сотрудники.Подразделение.Код КАК ПодразделениеКод,
	 |	Сотрудники.Телефон КАК Телефон,
	 |	Сотрудники.Пароль КАК Пароль,
	 |	Сотрудники.Уволен КАК Уволен,
	 |	Сотрудники.ДатаУвольнения КАК ДатаУвольнения,
	 |	Сотрудники.Партнер КАК Партнер,
	 |	Сотрудники.Отдел.Руководитель.Код КАК ОтделРуководительКод
	 |ИЗ
	 |	Справочник.Сотрудники КАК Сотрудники
	 |ГДЕ
	 |	Сотрудники.ВыгружатьНаСайт = ИСТИНА
	 |	И НЕ Сотрудники.ПометкаУдаления
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Должности.Ссылка КАК Ссылка,
	 |	Должности.Код КАК Код,
	 |	Должности.Наименование КАК Наименование
	 |ИЗ
	 |	Справочник.Должности КАК Должности
	 |ГДЕ
	 |	НЕ Должности.ПометкаУдаления
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Отделы.Ссылка КАК Ссылка,
	 |	Отделы.Код КАК Код,
	 |	Отделы.Наименование КАК Наименование
	 |ИЗ
	 |	Справочник.Отделы КАК Отделы
	 |ГДЕ
	 |	НЕ Отделы.ПометкаУдаления
	 |	И Отделы.ЭтоГруппа = ЛОЖЬ
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	СтруктураПредприятия.Ссылка КАК Ссылка,
	 |	СтруктураПредприятия.Код КАК Код,
	 |	СтруктураПредприятия.Наименование КАК Наименование
	 |ИЗ
	 |	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	 |ГДЕ
	 |	НЕ СтруктураПредприятия.ПометкаУдаления";
	 
	 Пакет = Запрос.ВыполнитьПакет();
	 Возврат Пакет;
 КонецФункции

Функция ПолучитьПользователей(Запрос)
	УстановитьПривилегированныйРежим(Истина);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/html");
	Ответ.Заголовки.Вставить("Access-Control-Allow-Methods", "OPTIONS, GET"); 
	
	ИмяПользователя = Запрос.ПараметрыURL["UserName"];
	ДанныеJSON = ПолучитьПользователейJSON(ИмяПользователя);
	стрJSON = АльтерраОбщегоНазначения.СформироватьСтрокуJSON(ДанныеJSON);
	Ответ.УстановитьТелоИзСтроки(стрJSON);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;
КонецФункции

Функция ПолучитьПользователейJSON(ИмяПользователя) 
	//ЗаписьЖурналаРегистрации("РегламентноеЗадание.ВыгрузкаСотрудниковJSON", УровеньЖурналаРегистрации.Примечание, , , "Начало формирования прайса");

	ПакетЗапросов= ПолучитьДанныеПользователейВыгрузки(ИмяПользователя);
	 
	//ВЫГРУЗКА
	ДанныеJSON= Новый Соответствие;
	 
	//Пользователи ИБ
	Выборка = ПакетЗапросов[0].Выбрать();
	мПользователиИБ = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПользователяИБ);
		Если ПользовательИБ <> Неопределено Тогда
			 
			ОписаниеПользователяИБ = Пользователи.НовоеОписаниеПользователяИБ();
			ПрочитанныеСвойства = Неопределено;
				
			ПрочитанныеСвойства = Пользователи.СвойстваПользователяИБ(ПользовательИБ.УникальныйИдентификатор);
			Если ПрочитанныеСвойства <> Неопределено Тогда		
					// Копирование свойств и ролей пользователяИБ.
					ЗаполнитьЗначенияСвойств(
						ОписаниеПользователяИБ,
						ПрочитанныеСвойства,
						"АутентификацияОС,
						|АутентификацияOpenID,
						|ЗапрещеноИзменятьПароль,
						|Имя,
						|ОсновнойИнтерфейс,
						|ПолноеИмя,
						|ПоказыватьВСпискеВыбора,
						|ПользовательОС,
						|РежимЗапуска,
						|Язык,
						|Роли");
			КонецЕсли;
		
			Отделы = УправлениеСвойствами.ЗначениеСвойства(Выборка.Пользователь, ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Отделы"));
			Если Отделы = Неопределено Тогда
				Отдел = "";
			Иначе	
				Отдел = Отделы.Наименование;
			КонецЕсли;
			ОписаниеПользователяИБ.Вставить("Отдел", Отдел);
			ОписаниеПользователяИБ.Вставить("Подразделение", Выборка.Подразделение);
			ОписаниеПользователяИБ.Удалить("УникальныйИдентификатор");
			ОписаниеПользователяИБ.Удалить("СтарыйПароль");
			ОписаниеПользователяИБ.Удалить("Пароль");
			ОписаниеПользователяИБ.Удалить("СохраняемоеЗначениеПароля");
			мПользователиИБ.Добавить(ОписаниеПользователяИБ);
		КонецЕсли;	
	КонецЦикла;
	 
	 //Группы доступа
	 Выборка= ПакетЗапросов[1].Выбрать();
	 мГруппыДоступа = Новый Массив;
	 Пока Выборка.Следующий() Цикл
		 Данные = Новый Структура;
	     Данные.Вставить("ГруппаДоступа", Выборка.ГруппаДоступа);
		 Данные.Вставить("ПрофильГруппыДоступа", Выборка.ПрофильГруппыДоступа);
	     мГруппыДоступа.Добавить(Данные);
	 КонецЦикла;
	 
	 //Группы пользователей
	 Выборка= ПакетЗапросов[2].Выбрать();
	 мГруппыПользователя = Новый Массив;
	 Пока Выборка.Следующий() Цикл
	     мГруппыПользователя.Добавить(Выборка.ГруппаПользователя);
	 КонецЦикла;
	 
	 //Профили групп доступа
	 мПрофилиГруппДоступа = Новый Массив;
	 ВыборкаПрофили = ПакетЗапросов[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	 Пока ВыборкаПрофили.Следующий() Цикл
		 Данные = Новый Структура;
	     Данные.Вставить("ПрофильГруппыДоступа", ВыборкаПрофили.ПрофильГруппыДоступа);
		 ВыборкаРоли = ВыборкаПрофили.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		 МассивРолей = Новый Массив;
		 Пока ВыборкаРоли.Следующий() Цикл
			 МассивРолей.Добавить(ВыборкаРоли.Роль); 
		 КонецЦикла;
		 Данные.Вставить("Роли", МассивРолей);
		 мПрофилиГруппДоступа.Добавить(Данные);	 
	 КонецЦикла;	 
	 
	 ДанныеJSON.Вставить("ПрофилиГруппДоступа", мПрофилиГруппДоступа);
	 ДанныеJSON.Вставить("ГруппыПользователя", мГруппыПользователя);
	 ДанныеJSON.Вставить("ГруппыДоступа", мГруппыДоступа);
	 ДанныеJSON.Вставить("Пользователи", мПользователиИБ);
	 
	 ПараметрыJSON = ОбщийHTTPСервер.СериализоватьВJSON(ДанныеJSON);
	 
	 Возврат ПараметрыJSON;
 КонецФункции

Функция ПолучитьДанныеПользователейВыгрузки(ИмяПользователя)
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ,
	 |	ПРЕДСТАВЛЕНИЕ(Пользователи.Подразделение) КАК Подразделение,
	 |	Пользователи.Ссылка КАК Пользователь
	 |ИЗ
	 |	Справочник.Пользователи КАК Пользователи
	 |ГДЕ
	 |	НЕ Пользователи.ПометкаУдаления
	 |	И Пользователи.Недействителен = ЛОЖЬ
	 |	И Пользователи.Ссылка = &Пользователь
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ПРЕДСТАВЛЕНИЕ(ГруппыДоступаПользователи.Ссылка) КАК ГруппаДоступа,
	 |	ПРЕДСТАВЛЕНИЕ(ПрофилиГруппДоступа.Ссылка) КАК ПрофильГруппыДоступа
	 |ИЗ
	 |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
	 |		ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступа.Ссылка
	 |ГДЕ
	 |	ГруппыДоступаПользователи.Пользователь = &Пользователь
	 |	И НЕ ГруппыДоступаПользователи.Ссылка.ПометкаУдаления
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ПРЕДСТАВЛЕНИЕ(ГруппыПользователейПользователиГруппы.Ссылка) КАК ГруппаПользователя
	 |ИЗ
	 |	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейПользователиГруппы
	 |ГДЕ
	 |	ГруппыПользователейПользователиГруппы.Пользователь = &Пользователь
	 |	И НЕ ГруппыПользователейПользователиГруппы.Ссылка.ПометкаУдаления
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ПрофилиГруппДоступаРоли.Ссылка.Представление КАК ПрофильГруппыДоступа,
	 |	ПрофилиГруппДоступаРоли.Роль.Представление КАК Роль
	 |ИЗ
	 |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	 |		ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка
	 |ГДЕ
	 |	ГруппыДоступаПользователи.Пользователь = &Пользователь
	 |	И НЕ ПрофилиГруппДоступаРоли.Ссылка.ПометкаУдаления
	 |ИТОГИ
	 |	МИНИМУМ(Роль)
	 |ПО
	 |	ПрофильГруппыДоступа";
	 
	 ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
	 Запрос.УстановитьПараметр("Пользователь", Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор));
	 Пакет = Запрос.ВыполнитьПакет();
	 Возврат Пакет;
 КонецФункции
